Autodesk.Revit.DB.Construction.#ctor(System.String,System.String)
Construction

Autodesk.Revit.DB.Construction.Name
Get the name of the Construction.
Remarks: This property is used to get the name of the Construction.

Autodesk.Revit.DB.Construction.Id
Get the id of the Construction.
Remarks: This property is used to get the id of the Construction.

Autodesk.Revit.DB.Construction
Construction definition for Project Information.
Remarks: This is used to define the information in Constructions.xml.